app/views/facturas/index.html.erb

SELECT "clientes".* FROM "clientes"
---
    <%= f.label :cliente_id, "Cliente", class: "block font-semibold" %>
    <%= f.collection_select :cliente_id, Cliente.all, :id, :nombre, prompt: "Seleccione un cliente", class: "w-full border rounded px-2 py-1" %>

SELECT "productos".* FROM "productos"
---
  <div id="productos-container">
    <% Producto.all.each do |producto| %>