app/controllers/clientes_controller.rb

SELECT "clientes".* FROM "clientes"
---
  def index
    @clientes = Cliente.all

INSERT INTO "clientes" ("nombre", "correo", "direccion", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["nombre", "Jimmy Feng"], ["correo", "jimmycjk349@gmail.com"], ["direccion", "150 mts San Rafael"], ["created_at", "2025-06-28 02:25:11.656516"], ["updated_at", "2025-06-28 02:25:11.656516"]]
---
  def create
    @cliente = Cliente.new(cliente_params)

    if @cliente.save

SELECT "clientes".* FROM "clientes" WHERE "clientes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_cliente
    @cliente = Cliente.find(params[:id])