app/controllers/facturas_controller.rb

  def index
    @productos = Producto.all.select { |p| p.stock > 5 }
---
SELECT "productos".* FROM "productos"