app/controllers/movimientos_controller.rb

SELECT "movimientos".* FROM "movimientos" ORDER BY "movimientos"."created_at" DESC
SELECT "productos".* FROM "productos" WHERE "productos"."id" IN (?, ?)  [["id", 2], ["id", 1]]
---
  def index
    @movimientos = Movimiento.includes(:producto).order(created_at: :desc)

INSERT INTO "movimientos" ("producto_id", "cantidad", "tipo", "nota", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["producto_id", 2], ["cantidad", 5], ["tipo", "entrada"], ["nota", "Agregando los primeros stocks"], ["created_at", "2025-06-28 01:54:51.648281"], ["updated_at", "2025-06-28 01:54:51.648281"]]
---
  def create
    @movimiento = Movimiento.new(movimiento_params)
    @movimiento.producto = @producto

    if @movimiento.save

SELECT "productos".* FROM "productos" WHERE "productos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_producto
    @producto = Producto.find(params[:producto_id]) if params[:producto_id]