app/controllers/productos_controller.rb

  def index
    @productos = Producto.all
---
SELECT "productos".* FROM "productos"

  def create
    @producto = Producto.new(producto_params)

    if @producto.save
---
INSERT INTO "productos" ("nombre", "precio", "stock", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["nombre", "Sandalias X pro max"], ["precio", 15.0], ["stock", 50], ["created_at", "2025-06-28 01:04:14.008415"], ["updated_at", "2025-06-28 01:04:14.008415"]]

  def update
    old_stock = @producto.stock

    if @producto.update(producto_params)
      nuevo_stock = @producto.stock
      diferencia = (nuevo_stock - old_stock).abs

      if diferencia > 0
        tipo = nuevo_stock > old_stock ? :entrada : :salida

        if tipo == :salida && old_stock < diferencia
          flash.now[:alert] = "No hay suficiente stock para reducir."
          render :edit, status: :unprocessable_entity
          return
        end

        @producto.movimientos.create!(cantidad: diferencia, tipo: tipo.to_s, nota: "Ajuste de stock por edición")
---
UPDATE "productos" SET "nombre" = ?, "precio" = ?, "updated_at" = ? WHERE "productos"."id" = ?  [["nombre", "Sandalias"], ["precio", 10000.0], ["updated_at", "2025-06-28 01:35:11.810899"], ["id", 1]]
INSERT INTO "movimientos" ("producto_id", "cantidad", "tipo", "nota", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["producto_id", 1], ["cantidad", 75], ["tipo", "entrada"], ["nota", "Ajuste de stock por edición"], ["created_at", "2025-06-28 01:17:44.718450"], ["updated_at", "2025-06-28 01:17:44.718450"]]

  def destroy
    @producto.destroy
---
DELETE FROM "productos" WHERE "productos"."id" = ?  [["id", 2]]

  def set_producto
    @producto = Producto.find(params[:id])
---
SELECT "productos".* FROM "productos" WHERE "productos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]