app/controllers/tasas_controller.rb

SELECT "tasas".* FROM "tasas"
---
  def index
    @tasas = Tasa.all