app/models/movimiento.rb

UPDATE "productos" SET "stock" = COALESCE("stock", 0) + ? WHERE "productos"."id" = ?  [["stock", 50], ["id", 1]]
---
  def actualizar_stock
    if tipo == 'entrada'
      producto.increment!(:stock, cantidad)
    elsif tipo == 'salida'
      producto.decrement!(:stock, cantidad)