app/models/producto.rb

  def ajustar_stock!(cantidad:, tipo:, nota: nil)
    raise ArgumentError, "Cantidad debe ser entero positivo" unless cantidad.is_a?(Integer) && cantidad > 0
    raise ArgumentError, "Tipo debe ser 'entrada' o 'salida'" unless %w[entrada salida].include?(tipo)

    if tipo == 'salida' && stock < cantidad
      raise StandardError, "No hay suficiente stock para realizar esta salida"
    end

    movimientos.create!(cantidad: cantidad, tipo: tipo, nota: nota)
---
INSERT INTO "movimientos" ("producto_id", "cantidad", "tipo", "nota", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["producto_id", 1], ["cantidad", 50], ["tipo", "entrada"], ["nota", "Stock inicial"], ["created_at", "2025-06-28 01:04:14.463890"], ["updated_at", "2025-06-28 01:04:14.463890"]]